docs/physics/rarita-schwinger.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rarita-Schwinger Fields</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Rarita-Schwinger Fields</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-e522a8c7-ccdb-4ff3-8e3d-c9358edddefe">1. Introduction</a></li>
<li><a href="#h-19de5aef-a3be-467d-93b1-6db947645960">2. Velo-Zwanziger Problem</a></li>
<li><a href="#h-e8e76a2c-9e38-495c-8659-061b73acd1ba">3. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-e522a8c7-ccdb-4ff3-8e3d-c9358edddefe" class="outline-2">
<h2 id="h-e522a8c7-ccdb-4ff3-8e3d-c9358edddefe"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-h-e522a8c7-ccdb-4ff3-8e3d-c9358edddefe">
<p>
Rarita-Schwinger field describes a spin-\(3/2\) field.
</p>
</div>
</div>


<div id="outline-container-h-19de5aef-a3be-467d-93b1-6db947645960" class="outline-2">
<h2 id="h-19de5aef-a3be-467d-93b1-6db947645960"><span class="section-number-2">2.</span> Velo-Zwanziger Problem</h2>
<div class="outline-text-2" id="text-h-19de5aef-a3be-467d-93b1-6db947645960">
<p>
The "obvious" action for fields which
</p>

<ol class="org-ol">
<li>have spin greater than 1</li>
<li>are in a massive irrep of the Lorentz group</li>
<li>have minimal coupling to electromagnetism</li>
</ol>

<p>
tend not to have hyperbolic equations of motion (i.e., violate the
familiar causality relations of general relativity). This is the
Velo-Zwanziger problem.
</p>

<p>
Usually the solution is either to take a massless field, or have
non-minimal coupling to electromagnetism.
</p>
</div>
</div>

<div id="outline-container-h-e8e76a2c-9e38-495c-8659-061b73acd1ba" class="outline-2">
<h2 id="h-e8e76a2c-9e38-495c-8659-061b73acd1ba"><span class="section-number-2">3.</span> References</h2>
<div class="outline-text-2" id="text-h-e8e76a2c-9e38-495c-8659-061b73acd1ba">
<ul class="org-ul">
<li>Massimo Porrati, Rakibur Rahman,<br>
"Causal Propagation of a Charged Spin 3/2 Field in an External Electromagnetic Background".<br>
<a href="https://arxiv.org/abs/0906.1432">arXiv:0906.1432</a>, 10 pages.</li>
<li>Thomas-Paul Hack, Mathias Makedonski,<br>
"A No-Go Theorem for the Consistent Quantization of the Massive
Gravitino on Robertson-Walker Spacetimes and Arbitrary Spin 3/2 Fields
on General Curved Spacetimes".<br>
<a href="https://arxiv.org/abs/1106.6327v2">arXiv:1106.6327v2</a>, 32 pages (the v3 is substantially abridged
to 8 pages).</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2023-03-15 Wed 09:34.</p>
</div>
</body>
</html>